package lesson_02.homework_02;

public class Application_01 {
    // Задача 1. Дано: Хитрый бухгалтер разделил 5 рублей на 2 кассы. Сколько рублей лежит в каждой кассе?
    //Вывести на консоль
    public static void main(String[] args) {
        double m = 5;
        double n = 2;
        double res = m / n;
        System.out.println(res);
       }
    }
